# DuctSizeIterator Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DuctSizeIterator Properties
DuctSizeIterator Class See Also
---
The DuctSizeIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Gets the item at the current position of the iterator. |
| CurrentObject |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
DuctSizeIterator Class
Autodesk.Revit.DB.Mechanical Namespace